app/controllers/admin/comments_controller.rb

  def destroy
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]