app/controllers/admin/posts_controller.rb

    def create
        @post = Post.new(post_params)

        if @post.save
---
INSERT INTO "posts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test post"], ["created_at", "2022-10-16 19:01:05.394703"], ["updated_at", "2022-10-16 19:01:05.394703"]]

    def update
        @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-10-16 19:01:05.642831"], ["id", 1]]