app/views/posts/_posts.html.erb

                     | <%= post.get_likes.size %> <%= (post.get_likes.size) == 1 ? "vote" : "votes" %>
                     | <%= post.comments.size %> <%= link_to ((post.comments.size) == 1 ? "comment" : "comments"), post %> </li>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]