app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
SELECT MAX("posts"."cached_votes_total") FROM "posts"
SELECT "posts".* FROM "posts" WHERE "posts"."cached_votes_total" = ? LIMIT ?  [["cached_votes_total", 1], ["LIMIT", 1]]
---
            <figure class="hof">
                <% if Post.maximum(:cached_votes_total) == 0 %>
                    There is no Hall of Famer at the moment!
                <% elsif post = Post.find_by(cached_votes_total:Post.maximum(:cached_votes_total)) %>