app/views/posts/show.html.erb

SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" IS NOT NULL LIMIT ?  [["post_id", 1], ["LIMIT", 1]]
---
            <%= link_to "By likes", sort_post_comments_path(@post, :scope => "likes") %>
            <% if @post.comments.any? %>