app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "post_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Added a comment!"], ["post_id", 1], ["author_id", 1], ["created_at", "2022-10-16 19:11:02.177183"], ["updated_at", "2022-10-16 19:11:02.177183"]]
---
    def create
        @comment = @post.comments.new(comment_params)
        @comment.author = current_user

        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def destroy
        @comment = @post.comments.find(params[:id])
        @comment.destroy