app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY cached_votes_total ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @posts = Post.all

INSERT INTO "posts" ("name", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?)  [["name", "Test"], ["created_at", "2022-10-18 00:13:57.617869"], ["updated_at", "2022-10-18 00:13:57.617869"], ["author_id", 3]]
---
    def create
        @post = Post.new(post_params)
        @post.author = current_user

        if @post.save

UPDATE "posts" SET "updated_at" = ?, "cached_votes_total" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-10-20 01:24:20.792567"], ["cached_votes_total", 0], ["id", 2]]
---
    def update
        @post.update(post_params)