app/controllers/posts_controller.rb

    def index
        if params[:search].present?
            @parameter = params[:search].downcase
            @tags = Tag.where("lower(name) LIKE ?", "%#{@parameter}%")
        else
            @tags = Tag.all
---
SELECT "tags".* FROM "tags" WHERE (lower(name) LIKE '%test%')
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "text"], ["LIMIT", 1]]

    def tag_index
        @tags = Tag.all
        @tag = Tag.find(params[:tag_id])
        @posts = Post.where(params[:tag_id] == @tag.id)

        if params[:scope] == "likes"
            @posts = @posts.orderedl
        else
            @posts = @posts.orderedt
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @post = Post.new(post_params)
        @post.author = current_user

        @post.tags = processed_tags

        if @post.save
---
INSERT INTO "tags" ("name") VALUES (?)  [["name", "latin"]]

    def show
        @comment = @post.comments.build
        @comments = @post.comments.where(params[:post_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" IS NOT NULL ORDER BY "comments"."created_at" ASC  [["post_id", 1]]

    def update
        if @post.update(post_params)
            @post.tags << processed_tags
---
INSERT INTO "tags" ("name") VALUES (?)  [["name", "latin"]]