app/controllers/tags_controller.rb

    def show
        @tags = Tag.all
        @tag = Tag.find(params[:id])

        @posts = Post.where(params[:tag_id] == @tag.id)

        if params[:scope] == "likes"
            @posts = @posts.orderedl
---
SELECT "tags".* FROM "tags" WHERE (3)
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"