app/controllers/users_controller.rb

    def show
        @posts = Post.where(author: @user)
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 3]]

    def update
        @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "about" = ? WHERE "users"."id" = ?  [["updated_at", "2022-10-17 23:59:10.080607"], ["about", ""], ["id", 3]]